In [5]:
import pandas as pd

In [6]:
friend_dict_list = [{'name': 'Jone', 'age': 20, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]

In [7]:
df = pd.DataFrame(friend_dict_list)

In [8]:
df

    name  age        job
0   Jone   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [9]:
# show 1,2 index
df[1:3]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [14]:
# 불연속적인 index 의 값 가져오기
# array 임을 확인
df.loc[[0, 2]]

   name  age      job
0  Jone   20  student
2  Nate   30  teacher

### by column condition

In [15]:
df[df.age > 25]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [16]:
df.query('age>25') # use string

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [19]:
# and gate
df[(df.age > 25) & (df.name == 'Nate')]

   name  age      job
2  Nate   30  teacher

### filter column

### by index

In [21]:
friend_list = [ ['John', 20, 'student'],['Jenny', 30, 'developer'],['Nate', 30, 'teacher'] ]
df = pd.DataFrame.from_records(friend_list)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

In [32]:
# first param is row, second is column
df.iloc[:, 0:2]

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [23]:
df.iloc[:2, 0:2]

       0   1
0   John  20
1  Jenny  30

## by column name

In [26]:
# you can create column header for no header data at once
df = pd.read_csv("data/friend_list_no_head.csv", header = None, names=['name', 'age', 'job'])
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [29]:
df_filtered = df[['name', 'age']]
df_filtered

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [31]:
df.filter(items=['age', 'job'])

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [33]:
# select columns containing 'a'
df.filter(like='a', axis=1)

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [35]:
# select columns using regex
df.filter(regex='b$', axis=1)

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern